<template>
  <div>
    <el-collapse>
  <el-collapse-item title="2020年聚知小额批发薪资提成制度" name="1">
     <b>组长和业务员提成计算方法</b>
        <br />
        <br />
        <li>客户订单总金额－工厂采购订单总金额－采购费－广告费－样品费－应酬费－品检包装费－推广费 －快递费－运费－出差费－上月累计个人亏损－工资（包括基本工资，保密工资，社保））*对应提成点</li>
        <li>a.按利润计算</li>
        <li>b.以月为单位</li>
        <li>c.①毛利决定工资级别；②（毛利-工资）决定提成级别</li>
        <li>假设案例：
        王某3月份业绩为10万元人民币，工厂采购订单费：83333.3元，采购费：0元，广告费：0元，样品费：0元,应酬费：0元，品检包装费：5000元，推广费：100元，快递费和运费：800元，出差费：0元，，上月累计个人亏损：0元，毛利：10766.7元，对应的月工资为三类（包括基本工资，保密工资，社保）：3300元，对应的提成点为A类：15%（毛利-工资=10766.7-3300=7466.7元）
        计算：  （（100000-83333.3 -0-0-0-0-5000-100-800-0-0）-3300）=7466.7元=A类
       A类15%：提成=7466.7*15%=1120.005元
       王某3月份全勤的情况下，在4月15日共计发放：3300元+1120.005元=4420.005元</li>
       <br />
       <br />
       <b>品检包装费</b>
       <br />
       <br />
       <li>客户月订单总金额x2%</li>
       <li>假设案例:李某12月订单总金额为20000元（包含样品金额），则其品检包装费为： 20000×2%=400元（包含纸箱，胶纸，吸塑袋等）</li>
       <br />
       <br />
       <b>运营计算方式</b>
       <li>底薪＋利润提成
          a.运营薪资=运营总提成-工资-出差费-应酬费-上月累计个人亏损
          b.运营薪资为负数时只领底薪，为正数时领底薪+正数值
       </li>
       <li>运营提成计算方式:A、老客户利润提成=业务利润提成的方法的1％
           假设案例：
           业务张某12月份业绩为110000元人民币，工厂订单采购费为80000元人民币，广告费0元，样品费0元，应酬费0元，品检包装费2400元，推广费400元，快递和运费600元，出差费0元，上月累积个人亏损0元，月工资5000元。

          老客户利润提成：（110000-80000-0-0-0-2400-400-600-0-0-5000）×1%=216元


          B、新客户利润提成=业务利润提成的方法的5％
          假设案例：
          张某12月份店铺业绩为90000元人民币，工厂采购订单费为69000元人民币，广告费0元，样品费0元，客人应酬费0元，品检包装费1600元，推广费200元，快递和运费430元，出差费0元，上月累积个人亏损0元，月工资5000元。
          新客户利润提成：（90000-69000-0-0-0-1600-200-430-0-0-5000）×5%=688.5元

          运营李某12月份薪资：
          假设①、216（老客户提成）＋688.5（新客户提成）-5000（运营底薪）-0（上月累计个人亏损）=-4095.5元。因为是负数，所以工资是底薪即5000元
          假设②、5000（老客户提成）＋688.5（新客户提成）--5000（运营底薪）-0（上月累计个人亏损）=688.5元。因为是正数，所以工资是5000元+688.5元=5688.5元
       </li>
       <br />
       <br />
       <b>采购薪资计算方式:底薪＋利润提成</b>
       <li>a.采购薪资=采购总提成-工资-出差费-应酬费-上月累计个人亏损
           b.采购薪资为负数时只领底薪，为正数时领底薪+正数值
           采购提成计算方式：业务利润提成的方法的5％</li>
      <li>假设案例：业务王某3月份业绩为10万元人民币，工厂采购订单费：83333.3元，广告费：0元，样品费：0元,应酬费：0元，品检包装费：5000元，推广费：100元，快递费和运费：800元，出差费：0元，，上月累计个人亏损：0元，毛利：10766.7元，月工资：3300元
          采购提成：  （（100000-83333.3 -0-0-0-5000-100-800-0-0）-3300）*5%=373.3元
          备：计算方式同运营一样</li>
      <li>附加：1、入职第一个月开始计算亏损和提成；</li>
      <li>2、新老同事入职（含试用期）4-6个月平均不够自已费用（累积工资），但是在满足50%价值观考核，50%办公室负责人和业务组长考核的情况下，公司决定是否再给一次机会；或者劝其转为合作制员工;
      </li>
      <li>3、实习生底薪：第1-6个月：2500元；7-12个月：2800元；第13个月开始：3000元。应届毕业生底薪：第1-6个月：2800元；第7个月开始：3000元。如考核期未过再给一次机会，实习生和应届毕业生底薪都保持不变。工资和提成在次月的15日结算（提成：订单金额需在当月月底前全款到账）；
      </li>
      <li>4、员工薪资计算方式
          a.全勤条件下，业务员及组长薪资按照工资+提成的方式，根据上述薪资表及利润提成表进行计算（如表1、表2及表3）
          b.事假病假计算方式：月工资-月工资总额÷当月应出勤天数×缺勤天数
          例如：12月份共计31天，公司规定每周日单休，减去12月份的5个星期天，当月应出勤天数为26天
          举例：员工A，12月份请假2天，其工资为3000元，则其当月请假扣薪方式为：3000÷26×2=231元，12月实际应发放薪资为3000-（3000÷26×2）=2769元
      </li>
      <li>5、业务业绩亏损按月累计（如这个月亏损累计到下个月，下个月的亏损累计到下下个月，以此类
        推），如因业务个人原因造成的订单亏损则在其个人利润中扣除；</li>
      <li>6、A、业务提成=表3
          B、组长提成=表3+本组纯利5%+新组长整组纯利8%+新新组长整组纯利2%
          C、办公室负责人分红：表3+本组纯利5%+新组长整组纯利8%+新新组长整组纯利2%+期权股10%（按各办公室负责人平均比例分红）
          D、经营团队分红：期权股10%

          备：a.新组长指老组长在自己团队里亲自培养出来的组长，以此类推，新新组长
          b.纯利分二年平均发放，中途离职的给留下来的分配（每年年底）
          c.期权股分红分三年平均发放（每年年底），中途离职的给留下来的分配
          d.在每年1月1日至12月31日期间离职的，不计当年纯利和期权股分红
          e.纯利指毛利减掉提成平台费，管理费，财务费，租金，办公室费，总共的平摊费用等之后的净利 
          f、仓库负责人算办公室负责人
      </li>
      <li>7、社保制度
          通过公司3个月试用期，员工自主选择是否缴纳社保；公司如上述表(1)表(2)，提供社保金额
          1000元，剩余部分由员工自己承担；如果因员工长时间请假等原因造成当月实际所发工资少于公
          司提供的社保金额1000元时，差额部分由员工自己承担
          举例说明：

          a.员工A，9月入职，各方面综合能力都为优，踏实上进，通过公司3个月的试用期考核。如12
          月薪资为3000元（基本薪资1800，保密费200，社保1000元），选择缴纳社保，全勤条件下，其
          当月薪资发放情况为3000-1000-个人应承担社保部分（未计提成）
          b.如员工A不缴纳社保，全勤条件下，其12月薪资发放情况为3000（未计提成）；
      </li>
      <li>8、邮箱须用公司企业邮箱，否则无效,当作泄密处理；</li>
      <li>9、辞职需提前一个月以上提交辞呈；如有特殊情况，须上报审批；</li>
      <li>10、离职交接完后工资和提成在次月15日结算；</li>
      <li>11、业务员年底无奖金；入职半年以下行政人员无补贴；入职半年以上行政人员，到年底按月补
          贴。例：A某每月固定薪资4000元，今年4月份入职，到年底12月一共入职10个月，则
          其年底补贴计算方式为：4000÷12×10=3333.3元
      </li>
      <li>12、带薪年休假：
          .   春节假期工资:7天工资(大年初一一大年初七)
          a.发放时间: 假设2020年1月23日前工作一年及以上的同事，春节假期7天工资将在2020年7月发放 
          b.2020年1月23日前工作未满一年的同事,需工作满一年后再推迟半年发放
          c.中途离职无春节假期工资
      </li>
      <li>13、所有人员每月考核价值观一次，作为公司人员去留的参考依据；</li>
      <li>14、试用期不满15天自动离职或3个工作日内被公司辞退的没有工资。</li>
      <li>15、公司高压线
        a.飞单、回扣、泄密客人信息等，没收所有已发放及未发放提成并自动离职；
        b.与外部（客户、供应商等）联合作假者，没收所有已发放及未发放提成并自动离职。
      </li>
      <li>ps:以上条例适合个人和团队</li>
      <br />
      <br />
      <b>合伙人员</b>
      <li>此方式适合自由创业人员，需签定合作协议;订单利润五五分成，无工资，在公司上班</li>
      <li>1、提成核算方式：
        （客户订单总金额－工厂采购订单总金额－采购费－广告费－-样品费－应酬费－品检包装费－
         推广费 －快递费－运费－出差费－上月累计个人亏损）*50％＝个人提成
      </li>
      <li>2、每月要求上班天数为20天，请假一天扣除薪资100元；钱从个人提成里扣除，扣除薪资用于公司
        团建快乐基金；一个月没有来上班一天，终止合作
      </li>
      <li>3、组长转为合伙人，除了个人业务利润5：5分成之外，享受之前组长待遇50%的政策提成；办公室
        负责人转为合伙人，将降级为组长，与组长转为合伙人提成计算方式一致，无期权分红。

        提成=个人利润50%+新组长整组纯利4%+新组长整组纯利1%

        备：a.纯利分二年平均发放，中途离职的给留下来的分配（每年年底）
            b.在每年1月1日至12月31日期间离职的，不计当年期权、纯利分红
            c.纯利指毛利减掉提成，平台费，管理费，财务费，租金，办公室费，总共的平摊费用等之后的净利
            d.在家办公的和没有当过组长，不享受这以上待遇政策
            e.在家办公的公司分红50%里的3%属于组长，每六个月发一次，在这期间离职的组长，提成取消，
            归公司。一个组长能带多少个在家办公的视情况而定。案例：李某当月挣2万元，那么公司分到1
            万，接着1万*3%=300元。所以组长当月300元。
            f.在公司办公的合作制，同以上e条款同理
            g.帮忙采购需要付给采购员费（参考值：客人营业额的0.5-1%或者自谈）
      </li>
      <li>4、合作终止时，所有的一切资源（包括客户，供应商，产品等）都归属于公司；</li>
      <li>5、邮箱须用公司企业邮箱，否则无效，当作泄密处理；</li>
      <li>6，合作制的分红在次月的15日结算（提成：订单金额需在当月月底前全款到账）；</li>
      <li>7、离职后提成在次月15日结算（前提交接完）；</li>
      <li>8、品检包装费：客户月订单总金额×2%
          假设案例：李某12月客户订单总金额为20000元（包含样品金额），则其品检包装费为：
          20000×2%=400元（包含纸箱，胶纸，吸塑袋等）
      </li>
      <li>10、高压线：
          1、飞单、回扣、泄密客人信息等，收回所有已发放及未发放提成并终止合作；
          2、与外部（客户、供应商等）联合作假者，收回所有已发放及未发放提成并终止合作
      </li>
      <br />
      <br />
      <li>本制度未尽事宜按公司有关规定执行
          最终解释权归公司所有
          执行时间：2020年1月1日至2020年12月31日（本制度每年12月30日之前会调整一次
          如有变动再进行补充条例更新
      </li>
  </el-collapse-item>
</el-collapse>

    <el-card class="operate-container" shadow="never">
      <el-collapse>
        <el-collapse-item title="提成比例规则，点击查看">
          <el-row :span="20">
            <el-col :span="10">
              <div class="forms">
                <p>薪资分配比如下：所有业务员(单位：元)(表1)</p>
                <el-table
                  size="small"
                  :border="true"
                  :fit="false"
                  :data="[{th:'一类',A:'1600',B:'200',C:'1000',D:'2800',E:'应届毕业生'},
                            {th:'二类（A）',A:'1800',B:'200',C:'1000',D:'3000',E:'有工作经验(波动薪资)'},
                            {th:'三类（B）',A:'2100',B:'200',C:'1000',D:'3300',E:'有工作经验(波动薪资)'},
                            {th:'四类（C）',A:'2200',B:'300',C:'1000',D:'3500',E:'有工作经验(波动薪资)'},
                            {th:'五类（D）',A:'2700',B:'300',C:'1000',D:'4000',E:'有工作经验(波动薪资)'},
                            {th:'六类（E）',A:'3200',B:'300',C:'1000',D:'4500',E:'有工作经验(波动薪资)'},
                            ]"
                  style="width: 621px"
                >
                  <el-table-column prop="th" label="类别" width="80" align="center"></el-table-column>
                  <el-table-column prop="A" label="基本工资" width="100" align="center"></el-table-column>
                  <el-table-column prop="B" label="保密费" width="100" align="center"></el-table-column>
                  <el-table-column prop="C" label="社保" width="100" align="center"></el-table-column>
                  <el-table-column prop="D" label="累计工资" width="100" align="center"></el-table-column>
                  <el-table-column prop="E" label="要求" width="140" align="center"></el-table-column>
                </el-table>
              </div>
            </el-col>
            <el-col :span="10">
              <div class="forms">
                <p>提成点分配比例：根据单月纯利润算提成(单位：元)(表三)</p>
                <el-table
                  size="small"
                  :border="true"
                  :fit="false"
                  :data="[{th:'纯利润',A:'0-10000',B:'10001-20000',C:'20001-30000',D:'30001-40000',E:'40001以上'},
                    {th:'提成点',A:'15%',B:'20%',C:'25%',D:'30%',E:'35%'},]"
                  style="width: 542px"
                >
                  <el-table-column prop="th" label="等级" width="80" align="center"></el-table-column>
                  <el-table-column prop="A" label="A" align="center"></el-table-column>
                  <el-table-column prop="B" label="B" width="100" align="center"></el-table-column>
                  <el-table-column prop="C" label="C" width="100" align="center"></el-table-column>
                  <el-table-column prop="D" label="D" width="100" align="center"></el-table-column>
                  <el-table-column prop="E" label="E" width="80" align="center"></el-table-column>
                </el-table>
              </div>
            </el-col>
          </el-row>
        </el-collapse-item>
      </el-collapse>
    </el-card>
  </div>
</template>
<script>
export default {
  name: "commissionTable",
  data() {
    return {
    };
  },
};
</script>
<style>
</style>